# All the messages will be parsed as HTML due to current configuration

MENU = "Мы в меню! Чем займемся? \U0001F648"

FILTER = "Какой фильтр выберем? \U0001F43E"

ERROR = "Упс... Иногда нашим обезьянкам трудно понять, что вы от них хотите. Пожалуйста, пользуйтесь кнопками и командами - их они точно поймут \U0001F9A7"

BILATERAL = "Будем применять двусторонний фильтр! Скорее отправляйте фото в чат"

GAUSSIAN_BLUR = "Пора размыть по Гауссу - уже ждем ваше фото в чат"

EMBOSS = "И вправду - сделаем фото рельефнее! Скорее отправляйте фото в чатик"

GRAYSCALE = "Будет выглядеть на все сто! Применим черно-белый фильтр сразу после того, как вы отправите фото в чат"

INVERT = "Инвертируем? Ждем желаемую фотографию в чат"

RETRO = "Стильный выбор! Сделаем ретро стиль сразу после того, как вы скинете фото в чат"

UNSELECTED_FILTER = "Нашим обезьянкам кажется, что вы не выбирали каких-либо фильтров... Попробуйте повторно пройтись по нужным кнопкам, прежде чем отправить фото \U0001F64A"

FILTERED = "Вот и результат - надеемся, вы оцените! \U0001F435"

ABOUT = """
<b>\U0001F64A Eco Monkey</b> - маленький, уютный и забавный Telegram-бот, посвященный одним из самых крутых животных - обезьянкам.

Функционал бота включает в себя:
\U000025AA Работу с изображениями путем применения любого из шести доступных фильтров:
\U000025AA Рассказ о каком-то интересном факте об этих животных
\U000025AA Измерение процента схожести с обезьянками
\U000025AA Узнать, какая ты обезьянка сегодня
\U000025AA Найти благотоворительный фонд для помощи обезьянкам

Кстати говоря, исходный код этого бота можно посмотреть по <a href="https://github.com/maseoff/Monkey-Bot">гиперссылке</a>. Надеемся, что вам понравится этот Telegram-бот и с ним вы проведете свое время весело и интересно. Приятного пользования - <b>мы рады, что выбрали именно нас!</b>

\U000026A0 Наш бот сохраняет ваши фото только на время обработки. Сразу же по ее окончании мы удаляем их с сервера!
""".strip()

FUND = """
<a href="https://apeactionafrica.org/"><b>\U0001F98D Ape Action Africa</b></a> - британская организация, занимающаяся защитой и сохранением горилл и шимпанзе на территории Африки. Основана в 1996 году и работает до сих пор! Их программа по защите и сохранению вымирающих видов обезьян явяляется крупнейшей на территории всей Африки! Подробная информация и проекты - на их веб-сайте

<a href="https://www.savingmonkeys.org/"><b>\U0001F412 Saving Monkeys</b></a> - занимается восстановлением тропических лесов, безопаностью и развитием хрупких экосистем и не только! Команда активно ориентируется на работу с обезьянами как обитателями природных ареалов, подвергающихся опасности. Подробная информация и проекты - на их веб-сайте

<a href="https://wwf.ru/"><b>\U0001F43C WWF</b></a> - одна из самых влиятельных организаций в сфере защиты природных богатств. Работает в более 100 странах (России тоже) и участвует в более 1000 проектах по защите природы. Подробная информация и проекты - на их веб-сайте

На этом пища для размышления не кончается! Мы предлагаем перейти по <a href="https://impactful.ninja/best-charities-for-monkeys/">гиперссылке (англ.)</a> и ознакомиться с другими фондами, реализующими программы по защите обезьян по всему миру
""".strip()
